name: "pytorch"
input: "data1"
input: "data2"
input_shape {
  dim: 1
  dim: 3
  dim: 512
  dim: 512
}
input_shape {
  dim: 1
  dim: 3
  dim: 512
  dim: 512
}
layer {
    name: "ConvNdBackward1"
    type: "Convolution"
    bottom: "data1"
    top: "ConvNdBackward1"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward2"
    type: "ReLU"
    bottom: "ConvNdBackward1"
    top: "LeakyReluBackward2"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward3"
    type: "Convolution"
    bottom: "LeakyReluBackward2"
    top: "ConvNdBackward3"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward4"
    type: "ReLU"
    bottom: "ConvNdBackward3"
    top: "LeakyReluBackward4"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward5"
    type: "Convolution"
    bottom: "data2"
    top: "ConvNdBackward5"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward6"
    type: "ReLU"
    bottom: "ConvNdBackward5"
    top: "LeakyReluBackward6"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward7"
    type: "Convolution"
    bottom: "LeakyReluBackward6"
    top: "ConvNdBackward7"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward8"
    type: "ReLU"
    bottom: "ConvNdBackward7"
    top: "LeakyReluBackward8"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward10"
    type: "Convolution"
    bottom: "LeakyReluBackward4"
    top: "ConvNdBackward10"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward11"
    type: "ReLU"
    bottom: "ConvNdBackward10"
    top: "LeakyReluBackward11"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward12"
    type: "Convolution"
    bottom: "LeakyReluBackward11"
    top: "ConvNdBackward12"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward13"
    type: "ReLU"
    bottom: "ConvNdBackward12"
    top: "LeakyReluBackward13"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward15"
    type: "Convolution"
    bottom: "LeakyReluBackward8"
    top: "ConvNdBackward15"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward16"
    type: "ReLU"
    bottom: "ConvNdBackward15"
    top: "LeakyReluBackward16"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward17"
    type: "Convolution"
    bottom: "LeakyReluBackward16"
    top: "ConvNdBackward17"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward18"
    type: "ReLU"
    bottom: "ConvNdBackward17"
    top: "LeakyReluBackward18"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward20"
    type: "Convolution"
    bottom: "LeakyReluBackward13"
    top: "ConvNdBackward20"
    convolution_param {
        num_output: 64
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward21"
    type: "ReLU"
    bottom: "ConvNdBackward20"
    top: "LeakyReluBackward21"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward22"
    type: "Convolution"
    bottom: "LeakyReluBackward21"
    top: "ConvNdBackward22"
    convolution_param {
        num_output: 64
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward23"
    type: "ReLU"
    bottom: "ConvNdBackward22"
    top: "LeakyReluBackward23"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward25"
    type: "Convolution"
    bottom: "LeakyReluBackward18"
    top: "ConvNdBackward25"
    convolution_param {
        num_output: 64
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward26"
    type: "ReLU"
    bottom: "ConvNdBackward25"
    top: "LeakyReluBackward26"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward27"
    type: "Convolution"
    bottom: "LeakyReluBackward26"
    top: "ConvNdBackward27"
    convolution_param {
        num_output: 64
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward28"
    type: "ReLU"
    bottom: "ConvNdBackward27"
    top: "LeakyReluBackward28"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward30"
    type: "Convolution"
    bottom: "LeakyReluBackward23"
    top: "ConvNdBackward30"
    convolution_param {
        num_output: 96
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward31"
    type: "ReLU"
    bottom: "ConvNdBackward30"
    top: "LeakyReluBackward31"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward32"
    type: "Convolution"
    bottom: "LeakyReluBackward31"
    top: "ConvNdBackward32"
    convolution_param {
        num_output: 96
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward33"
    type: "ReLU"
    bottom: "ConvNdBackward32"
    top: "LeakyReluBackward33"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward35"
    type: "Convolution"
    bottom: "LeakyReluBackward28"
    top: "ConvNdBackward35"
    convolution_param {
        num_output: 96
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward36"
    type: "ReLU"
    bottom: "ConvNdBackward35"
    top: "LeakyReluBackward36"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward37"
    type: "Convolution"
    bottom: "LeakyReluBackward36"
    top: "ConvNdBackward37"
    convolution_param {
        num_output: 96
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward38"
    type: "ReLU"
    bottom: "ConvNdBackward37"
    top: "LeakyReluBackward38"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward40"
    type: "Convolution"
    bottom: "LeakyReluBackward33"
    top: "ConvNdBackward40"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward41"
    type: "ReLU"
    bottom: "ConvNdBackward40"
    top: "LeakyReluBackward41"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward42"
    type: "Convolution"
    bottom: "LeakyReluBackward41"
    top: "ConvNdBackward42"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward43"
    type: "ReLU"
    bottom: "ConvNdBackward42"
    top: "LeakyReluBackward43"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward45"
    type: "Convolution"
    bottom: "LeakyReluBackward38"
    top: "ConvNdBackward45"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward46"
    type: "ReLU"
    bottom: "ConvNdBackward45"
    top: "LeakyReluBackward46"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward47"
    type: "Convolution"
    bottom: "LeakyReluBackward46"
    top: "ConvNdBackward47"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward48"
    type: "ReLU"
    bottom: "ConvNdBackward47"
    top: "LeakyReluBackward48"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward50"
    type: "Convolution"
    bottom: "LeakyReluBackward43"
    top: "ConvNdBackward50"
    convolution_param {
        num_output: 192
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward51"
    type: "ReLU"
    bottom: "ConvNdBackward50"
    top: "LeakyReluBackward51"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward52"
    type: "Convolution"
    bottom: "LeakyReluBackward51"
    top: "ConvNdBackward52"
    convolution_param {
        num_output: 192
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward53"
    type: "ReLU"
    bottom: "ConvNdBackward52"
    top: "LeakyReluBackward53"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward55"
    type: "Convolution"
    bottom: "LeakyReluBackward48"
    top: "ConvNdBackward55"
    convolution_param {
        num_output: 192
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward56"
    type: "ReLU"
    bottom: "ConvNdBackward55"
    top: "LeakyReluBackward56"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward57"
    type: "Convolution"
    bottom: "LeakyReluBackward56"
    top: "ConvNdBackward57"
    convolution_param {
        num_output: 192
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward58"
    type: "ReLU"
    bottom: "ConvNdBackward57"
    top: "LeakyReluBackward58"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "IndexBackward60"
    type: "Slice"
    bottom: "LeakyReluBackward58"
    top: "IndexBackward60"
    top: "IndexBackward60_zcam"
    slice_param {
        axis: 1
        slice_point: 2
    }
}
layer {
    name: "SubBackward162"
    type: "Eltwise"
    bottom: "IndexBackward60"
    bottom: "IndexBackward60"
    top: "SubBackward162"
    eltwise_param {
        operation: SUM
        coeff: 1
        coeff: -1
    }
}
layer {
    name: "Resample2dFunctionBackward63"
    type: "FlowWarp"
    bottom: "LeakyReluBackward58"
    bottom: "SubBackward162"
    top: "Resample2dFunctionBackward63"
}
layer {
    name: "CatBackward65"
    type: "Concat"
    bottom: "LeakyReluBackward53"
    bottom: "Resample2dFunctionBackward63"
    bottom: "SubBackward162"
    top: "CatBackward65"
    concat_param {
        axis: 1
    }
}
layer {
    name: "ConvNdBackward66"
    type: "Convolution"
    bottom: "CatBackward65"
    top: "ConvNdBackward66"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward67"
    type: "ReLU"
    bottom: "ConvNdBackward66"
    top: "LeakyReluBackward67"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward68"
    type: "Convolution"
    bottom: "LeakyReluBackward67"
    top: "ConvNdBackward68"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward69"
    type: "ReLU"
    bottom: "ConvNdBackward68"
    top: "LeakyReluBackward69"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward70"
    type: "Convolution"
    bottom: "LeakyReluBackward69"
    top: "ConvNdBackward70"
    convolution_param {
        num_output: 96
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward71"
    type: "ReLU"
    bottom: "ConvNdBackward70"
    top: "LeakyReluBackward71"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward72"
    type: "Convolution"
    bottom: "LeakyReluBackward71"
    top: "ConvNdBackward72"
    convolution_param {
        num_output: 64
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward73"
    type: "ReLU"
    bottom: "ConvNdBackward72"
    top: "LeakyReluBackward73"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward74"
    type: "Convolution"
    bottom: "LeakyReluBackward73"
    top: "ConvNdBackward74"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward75"
    type: "ReLU"
    bottom: "ConvNdBackward74"
    top: "LeakyReluBackward75"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward76"
    type: "Convolution"
    bottom: "LeakyReluBackward75"
    top: "ConvNdBackward76"
    convolution_param {
        num_output: 2
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "UpsamplingBilinear2dBackward77"
    type: "Deconvolution"
    bottom: "ConvNdBackward76"
    top: "UpsamplingBilinear2dBackward77"
    convolution_param {
        num_output: 2
        group: 2
        kernel_size: 4
        stride: 2
        pad: 1
        weight_filler {
            type: "bilinear"
        }
        bias_term: false
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
}
layer {
    name: "Resample2dFunctionBackward78"
    type: "FlowWarp"
    bottom: "LeakyReluBackward48"
    bottom: "UpsamplingBilinear2dBackward77"
    top: "Resample2dFunctionBackward78"
}
layer {
    name: "CatBackward80"
    type: "Concat"
    bottom: "LeakyReluBackward43"
    bottom: "Resample2dFunctionBackward78"
    bottom: "UpsamplingBilinear2dBackward77"
    top: "CatBackward80"
    concat_param {
        axis: 1
    }
}
layer {
    name: "ConvNdBackward81"
    type: "Convolution"
    bottom: "CatBackward80"
    top: "ConvNdBackward81"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward82"
    type: "ReLU"
    bottom: "ConvNdBackward81"
    top: "LeakyReluBackward82"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward83"
    type: "Convolution"
    bottom: "LeakyReluBackward82"
    top: "ConvNdBackward83"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward84"
    type: "ReLU"
    bottom: "ConvNdBackward83"
    top: "LeakyReluBackward84"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward85"
    type: "Convolution"
    bottom: "LeakyReluBackward84"
    top: "ConvNdBackward85"
    convolution_param {
        num_output: 96
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward86"
    type: "ReLU"
    bottom: "ConvNdBackward85"
    top: "LeakyReluBackward86"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward87"
    type: "Convolution"
    bottom: "LeakyReluBackward86"
    top: "ConvNdBackward87"
    convolution_param {
        num_output: 64
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward88"
    type: "ReLU"
    bottom: "ConvNdBackward87"
    top: "LeakyReluBackward88"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward89"
    type: "Convolution"
    bottom: "LeakyReluBackward88"
    top: "ConvNdBackward89"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward90"
    type: "ReLU"
    bottom: "ConvNdBackward89"
    top: "LeakyReluBackward90"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward91"
    type: "Convolution"
    bottom: "LeakyReluBackward90"
    top: "ConvNdBackward91"
    convolution_param {
        num_output: 2
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "UpsamplingBilinear2dBackward92"
    type: "Deconvolution"
    bottom: "ConvNdBackward91"
    top: "UpsamplingBilinear2dBackward92"
    convolution_param {
        num_output: 2
        group: 2
        kernel_size: 4
        stride: 2
        pad: 1
        weight_filler {
            type: "bilinear"
        }
        bias_term: false
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
}
layer {
    name: "Resample2dFunctionBackward93"
    type: "FlowWarp"
    bottom: "LeakyReluBackward38"
    bottom: "UpsamplingBilinear2dBackward92"
    top: "Resample2dFunctionBackward93"
}
layer {
    name: "CatBackward95"
    type: "Concat"
    bottom: "LeakyReluBackward33"
    bottom: "Resample2dFunctionBackward93"
    bottom: "UpsamplingBilinear2dBackward92"
    top: "CatBackward95"
    concat_param {
        axis: 1
    }
}
layer {
    name: "ConvNdBackward96"
    type: "Convolution"
    bottom: "CatBackward95"
    top: "ConvNdBackward96"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward97"
    type: "ReLU"
    bottom: "ConvNdBackward96"
    top: "LeakyReluBackward97"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward98"
    type: "Convolution"
    bottom: "LeakyReluBackward97"
    top: "ConvNdBackward98"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward99"
    type: "ReLU"
    bottom: "ConvNdBackward98"
    top: "LeakyReluBackward99"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward100"
    type: "Convolution"
    bottom: "LeakyReluBackward99"
    top: "ConvNdBackward100"
    convolution_param {
        num_output: 96
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward101"
    type: "ReLU"
    bottom: "ConvNdBackward100"
    top: "LeakyReluBackward101"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward102"
    type: "Convolution"
    bottom: "LeakyReluBackward101"
    top: "ConvNdBackward102"
    convolution_param {
        num_output: 64
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward103"
    type: "ReLU"
    bottom: "ConvNdBackward102"
    top: "LeakyReluBackward103"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward104"
    type: "Convolution"
    bottom: "LeakyReluBackward103"
    top: "ConvNdBackward104"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward105"
    type: "ReLU"
    bottom: "ConvNdBackward104"
    top: "LeakyReluBackward105"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward106"
    type: "Convolution"
    bottom: "LeakyReluBackward105"
    top: "ConvNdBackward106"
    convolution_param {
        num_output: 2
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "UpsamplingBilinear2dBackward107"
    type: "Deconvolution"
    bottom: "ConvNdBackward106"
    top: "UpsamplingBilinear2dBackward107"
    convolution_param {
        num_output: 2
        group: 2
        kernel_size: 4
        stride: 2
        pad: 1
        weight_filler {
            type: "bilinear"
        }
        bias_term: false
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
}
layer {
    name: "Resample2dFunctionBackward108"
    type: "FlowWarp"
    bottom: "LeakyReluBackward28"
    bottom: "UpsamplingBilinear2dBackward107"
    top: "Resample2dFunctionBackward108"
}
layer {
    name: "CatBackward110"
    type: "Concat"
    bottom: "LeakyReluBackward23"
    bottom: "Resample2dFunctionBackward108"
    bottom: "UpsamplingBilinear2dBackward107"
    top: "CatBackward110"
    concat_param {
        axis: 1
    }
}
layer {
    name: "ConvNdBackward111"
    type: "Convolution"
    bottom: "CatBackward110"
    top: "ConvNdBackward111"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward112"
    type: "ReLU"
    bottom: "ConvNdBackward111"
    top: "LeakyReluBackward112"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward113"
    type: "Convolution"
    bottom: "LeakyReluBackward112"
    top: "ConvNdBackward113"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward114"
    type: "ReLU"
    bottom: "ConvNdBackward113"
    top: "LeakyReluBackward114"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward115"
    type: "Convolution"
    bottom: "LeakyReluBackward114"
    top: "ConvNdBackward115"
    convolution_param {
        num_output: 96
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward116"
    type: "ReLU"
    bottom: "ConvNdBackward115"
    top: "LeakyReluBackward116"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward117"
    type: "Convolution"
    bottom: "LeakyReluBackward116"
    top: "ConvNdBackward117"
    convolution_param {
        num_output: 64
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward118"
    type: "ReLU"
    bottom: "ConvNdBackward117"
    top: "LeakyReluBackward118"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward119"
    type: "Convolution"
    bottom: "LeakyReluBackward118"
    top: "ConvNdBackward119"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward120"
    type: "ReLU"
    bottom: "ConvNdBackward119"
    top: "LeakyReluBackward120"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward121"
    type: "Convolution"
    bottom: "LeakyReluBackward120"
    top: "ConvNdBackward121"
    convolution_param {
        num_output: 2
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "UpsamplingBilinear2dBackward122"
    type: "Deconvolution"
    bottom: "ConvNdBackward121"
    top: "UpsamplingBilinear2dBackward122"
    convolution_param {
        num_output: 2
        group: 2
        kernel_size: 4
        stride: 2
        pad: 1
        weight_filler {
            type: "bilinear"
        }
        bias_term: false
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
}
layer {
    name: "Resample2dFunctionBackward123"
    type: "FlowWarp"
    bottom: "LeakyReluBackward18"
    bottom: "UpsamplingBilinear2dBackward122"
    top: "Resample2dFunctionBackward123"
}
layer {
    name: "CatBackward125"
    type: "Concat"
    bottom: "LeakyReluBackward13"
    bottom: "Resample2dFunctionBackward123"
    bottom: "UpsamplingBilinear2dBackward122"
    top: "CatBackward125"
    concat_param {
        axis: 1
    }
}
layer {
    name: "ConvNdBackward126"
    type: "Convolution"
    bottom: "CatBackward125"
    top: "ConvNdBackward126"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward127"
    type: "ReLU"
    bottom: "ConvNdBackward126"
    top: "LeakyReluBackward127"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward128"
    type: "Convolution"
    bottom: "LeakyReluBackward127"
    top: "ConvNdBackward128"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward129"
    type: "ReLU"
    bottom: "ConvNdBackward128"
    top: "LeakyReluBackward129"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward130"
    type: "Convolution"
    bottom: "LeakyReluBackward129"
    top: "ConvNdBackward130"
    convolution_param {
        num_output: 96
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward131"
    type: "ReLU"
    bottom: "ConvNdBackward130"
    top: "LeakyReluBackward131"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward132"
    type: "Convolution"
    bottom: "LeakyReluBackward131"
    top: "ConvNdBackward132"
    convolution_param {
        num_output: 64
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward133"
    type: "ReLU"
    bottom: "ConvNdBackward132"
    top: "LeakyReluBackward133"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward134"
    type: "Convolution"
    bottom: "LeakyReluBackward133"
    top: "ConvNdBackward134"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward135"
    type: "ReLU"
    bottom: "ConvNdBackward134"
    top: "LeakyReluBackward135"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward136"
    type: "Convolution"
    bottom: "LeakyReluBackward135"
    top: "ConvNdBackward136"
    convolution_param {
        num_output: 2
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "UpsamplingBilinear2dBackward137"
    type: "Deconvolution"
    bottom: "ConvNdBackward136"
    top: "UpsamplingBilinear2dBackward137"
    convolution_param {
        num_output: 2
        group: 2
        kernel_size: 4
        stride: 2
        pad: 1
        weight_filler {
            type: "bilinear"
        }
        bias_term: false
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
}
layer {
    name: "Resample2dFunctionBackward138"
    type: "FlowWarp"
    bottom: "LeakyReluBackward8"
    bottom: "UpsamplingBilinear2dBackward137"
    top: "Resample2dFunctionBackward138"
}
layer {
    name: "CatBackward140"
    type: "Concat"
    bottom: "LeakyReluBackward4"
    bottom: "Resample2dFunctionBackward138"
    bottom: "UpsamplingBilinear2dBackward137"
    top: "CatBackward140"
    concat_param {
        axis: 1
    }
}
layer {
    name: "ConvNdBackward141"
    type: "Convolution"
    bottom: "CatBackward140"
    top: "ConvNdBackward141"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward142"
    type: "ReLU"
    bottom: "ConvNdBackward141"
    top: "LeakyReluBackward142"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward143"
    type: "Convolution"
    bottom: "LeakyReluBackward142"
    top: "ConvNdBackward143"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward144"
    type: "ReLU"
    bottom: "ConvNdBackward143"
    top: "LeakyReluBackward144"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward145"
    type: "Convolution"
    bottom: "LeakyReluBackward144"
    top: "ConvNdBackward145"
    convolution_param {
        num_output: 96
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward146"
    type: "ReLU"
    bottom: "ConvNdBackward145"
    top: "LeakyReluBackward146"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward147"
    type: "Convolution"
    bottom: "LeakyReluBackward146"
    top: "ConvNdBackward147"
    convolution_param {
        num_output: 64
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward148"
    type: "ReLU"
    bottom: "ConvNdBackward147"
    top: "LeakyReluBackward148"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward149"
    type: "Convolution"
    bottom: "LeakyReluBackward148"
    top: "ConvNdBackward149"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward150"
    type: "ReLU"
    bottom: "ConvNdBackward149"
    top: "LeakyReluBackward150"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward152"
    type: "Convolution"
    bottom: "LeakyReluBackward150"
    top: "ConvNdBackward152"
    convolution_param {
        num_output: 2
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "CatBackward153"
    type: "Concat"
    bottom: "LeakyReluBackward150"
    bottom: "ConvNdBackward152"
    top: "CatBackward153"
    concat_param {
        axis: 1
    }
}
layer {
    name: "ConvNdBackward154"
    type: "Convolution"
    bottom: "CatBackward153"
    top: "ConvNdBackward154"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: false
    }
}
layer {
    name: "LeakyReluBackward155"
    type: "ReLU"
    bottom: "ConvNdBackward154"
    top: "LeakyReluBackward155"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward156"
    type: "Convolution"
    bottom: "LeakyReluBackward155"
    top: "ConvNdBackward156"
    convolution_param {
        num_output: 128
        pad_h: 2
        pad_w: 2
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 2
        bias_term: false
    }
}
layer {
    name: "LeakyReluBackward157"
    type: "ReLU"
    bottom: "ConvNdBackward156"
    top: "LeakyReluBackward157"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward158"
    type: "Convolution"
    bottom: "LeakyReluBackward157"
    top: "ConvNdBackward158"
    convolution_param {
        num_output: 128
        pad_h: 4
        pad_w: 4
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 4
        bias_term: false
    }
}
layer {
    name: "LeakyReluBackward159"
    type: "ReLU"
    bottom: "ConvNdBackward158"
    top: "LeakyReluBackward159"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward160"
    type: "Convolution"
    bottom: "LeakyReluBackward159"
    top: "ConvNdBackward160"
    convolution_param {
        num_output: 96
        pad_h: 8
        pad_w: 8
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 8
        bias_term: false
    }
}
layer {
    name: "LeakyReluBackward161"
    type: "ReLU"
    bottom: "ConvNdBackward160"
    top: "LeakyReluBackward161"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward162"
    type: "Convolution"
    bottom: "LeakyReluBackward161"
    top: "ConvNdBackward162"
    convolution_param {
        num_output: 64
        pad_h: 16
        pad_w: 16
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 16
        bias_term: false
    }
}
layer {
    name: "LeakyReluBackward163"
    type: "ReLU"
    bottom: "ConvNdBackward162"
    top: "LeakyReluBackward163"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward164"
    type: "Convolution"
    bottom: "LeakyReluBackward163"
    top: "ConvNdBackward164"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: false
    }
}
layer {
    name: "LeakyReluBackward165"
    type: "ReLU"
    bottom: "ConvNdBackward164"
    top: "LeakyReluBackward165"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward166"
    type: "Convolution"
    bottom: "LeakyReluBackward165"
    top: "ConvNdBackward166"
    convolution_param {
        num_output: 2
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: false
    }
}
layer {
    name: "AddBackward1168"
    type: "Eltwise"
    bottom: "ConvNdBackward166"
    bottom: "ConvNdBackward152"
    top: "AddBackward1168"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "UpsamplingBilinear2dBackward169"
    type: "Deconvolution"
    bottom: "AddBackward1168"
    top: "UpsamplingBilinear2dBackward169"
    convolution_param {
        num_output: 2
        group: 2
        kernel_size: 4
        stride: 2
        pad: 1
        weight_filler {
            type: "bilinear"
        }
        bias_term: false
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
}
layer {
    name: "MulBackward0170"
    type: "Eltwise"
    bottom: "UpsamplingBilinear2dBackward169"
    top: "MulBackward0170"
    eltwise_param {
        operation: MUL
        mulvalue: 0.5
    }
}
layer {
    name: "Resample2dFunctionBackward171"
    type: "FlowWarp"
    bottom: "data1"
    bottom: "MulBackward0170"
    top: "Resample2dFunctionBackward171"
}
layer {
    name: "ConvNdBackward172"
    type: "Convolution"
    bottom: "data1"
    top: "ConvNdBackward172"
    convolution_param {
        num_output: 64
        pad_h: 3
        pad_w: 3
        kernel_h: 7
        kernel_w: 7
        stride: 1
        dilation: 1
        bias_term: false
    }
}
layer {
    name: "Resample2dFunctionBackward174"
    type: "FlowWarp"
    bottom: "ConvNdBackward172"
    bottom: "MulBackward0170"
    top: "Resample2dFunctionBackward174"
}
layer {
    name: "ConvNdBackward175"
    type: "Convolution"
    bottom: "data2"
    top: "ConvNdBackward175"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward176"
    type: "ReLU"
    bottom: "ConvNdBackward175"
    top: "LeakyReluBackward176"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward177"
    type: "Convolution"
    bottom: "LeakyReluBackward176"
    top: "ConvNdBackward177"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward178"
    type: "ReLU"
    bottom: "ConvNdBackward177"
    top: "LeakyReluBackward178"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward179"
    type: "Convolution"
    bottom: "data1"
    top: "ConvNdBackward179"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward180"
    type: "ReLU"
    bottom: "ConvNdBackward179"
    top: "LeakyReluBackward180"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward181"
    type: "Convolution"
    bottom: "LeakyReluBackward180"
    top: "ConvNdBackward181"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward182"
    type: "ReLU"
    bottom: "ConvNdBackward181"
    top: "LeakyReluBackward182"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward184"
    type: "Convolution"
    bottom: "LeakyReluBackward178"
    top: "ConvNdBackward184"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward185"
    type: "ReLU"
    bottom: "ConvNdBackward184"
    top: "LeakyReluBackward185"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward186"
    type: "Convolution"
    bottom: "LeakyReluBackward185"
    top: "ConvNdBackward186"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward187"
    type: "ReLU"
    bottom: "ConvNdBackward186"
    top: "LeakyReluBackward187"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward189"
    type: "Convolution"
    bottom: "LeakyReluBackward182"
    top: "ConvNdBackward189"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward190"
    type: "ReLU"
    bottom: "ConvNdBackward189"
    top: "LeakyReluBackward190"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward191"
    type: "Convolution"
    bottom: "LeakyReluBackward190"
    top: "ConvNdBackward191"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward192"
    type: "ReLU"
    bottom: "ConvNdBackward191"
    top: "LeakyReluBackward192"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward194"
    type: "Convolution"
    bottom: "LeakyReluBackward187"
    top: "ConvNdBackward194"
    convolution_param {
        num_output: 64
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward195"
    type: "ReLU"
    bottom: "ConvNdBackward194"
    top: "LeakyReluBackward195"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward196"
    type: "Convolution"
    bottom: "LeakyReluBackward195"
    top: "ConvNdBackward196"
    convolution_param {
        num_output: 64
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward197"
    type: "ReLU"
    bottom: "ConvNdBackward196"
    top: "LeakyReluBackward197"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward199"
    type: "Convolution"
    bottom: "LeakyReluBackward192"
    top: "ConvNdBackward199"
    convolution_param {
        num_output: 64
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward200"
    type: "ReLU"
    bottom: "ConvNdBackward199"
    top: "LeakyReluBackward200"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward201"
    type: "Convolution"
    bottom: "LeakyReluBackward200"
    top: "ConvNdBackward201"
    convolution_param {
        num_output: 64
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward202"
    type: "ReLU"
    bottom: "ConvNdBackward201"
    top: "LeakyReluBackward202"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward204"
    type: "Convolution"
    bottom: "LeakyReluBackward197"
    top: "ConvNdBackward204"
    convolution_param {
        num_output: 96
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward205"
    type: "ReLU"
    bottom: "ConvNdBackward204"
    top: "LeakyReluBackward205"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward206"
    type: "Convolution"
    bottom: "LeakyReluBackward205"
    top: "ConvNdBackward206"
    convolution_param {
        num_output: 96
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward207"
    type: "ReLU"
    bottom: "ConvNdBackward206"
    top: "LeakyReluBackward207"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward209"
    type: "Convolution"
    bottom: "LeakyReluBackward202"
    top: "ConvNdBackward209"
    convolution_param {
        num_output: 96
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward210"
    type: "ReLU"
    bottom: "ConvNdBackward209"
    top: "LeakyReluBackward210"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward211"
    type: "Convolution"
    bottom: "LeakyReluBackward210"
    top: "ConvNdBackward211"
    convolution_param {
        num_output: 96
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward212"
    type: "ReLU"
    bottom: "ConvNdBackward211"
    top: "LeakyReluBackward212"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward214"
    type: "Convolution"
    bottom: "LeakyReluBackward207"
    top: "ConvNdBackward214"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward215"
    type: "ReLU"
    bottom: "ConvNdBackward214"
    top: "LeakyReluBackward215"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward216"
    type: "Convolution"
    bottom: "LeakyReluBackward215"
    top: "ConvNdBackward216"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward217"
    type: "ReLU"
    bottom: "ConvNdBackward216"
    top: "LeakyReluBackward217"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward219"
    type: "Convolution"
    bottom: "LeakyReluBackward212"
    top: "ConvNdBackward219"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward220"
    type: "ReLU"
    bottom: "ConvNdBackward219"
    top: "LeakyReluBackward220"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward221"
    type: "Convolution"
    bottom: "LeakyReluBackward220"
    top: "ConvNdBackward221"
    convolution_param {
        num_output: 128
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward222"
    type: "ReLU"
    bottom: "ConvNdBackward221"
    top: "LeakyReluBackward222"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward224"
    type: "Convolution"
    bottom: "LeakyReluBackward217"
    top: "ConvNdBackward224"
    convolution_param {
        num_output: 192
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward225"
    type: "ReLU"
    bottom: "ConvNdBackward224"
    top: "LeakyReluBackward225"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward226"
    type: "Convolution"
    bottom: "LeakyReluBackward225"
    top: "ConvNdBackward226"
    convolution_param {
        num_output: 192
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward227"
    type: "ReLU"
    bottom: "ConvNdBackward226"
    top: "LeakyReluBackward227"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward229"
    type: "Convolution"
    bottom: "LeakyReluBackward222"
    top: "ConvNdBackward229"
    convolution_param {
        num_output: 192
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        bias_term: true
    }
}
layer {
    name: "LeakyReluBackward230"
    type: "ReLU"
    bottom: "ConvNdBackward229"
    top: "LeakyReluBackward230"
    relu_param {
        negative_slope: 0.01
    }
}
layer {
    name: "ConvNdBackward231"
    type: "Convolution"
    bottom: "LeakyReluBackward230"
    top: "ConvNdBackward231"
    convolution_param {
        num_output: 192
        pad_h: 1
